Revit 2024 API
Room.BaseOffset Property
Get or Set the Base Offset of the Room.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public double BaseOffset { get; set; }
Visual Basic
Public Property BaseOffset As Double
	Get
	Set
Visual C++
public:
property double BaseOffset {
	double get ();
	void set (double value);
}
Remarks
This property is used to get or set the Base Offset of the Room.
See Also
Room Class
Autodesk.Revit.DB.Architecture Namespace